---
title: 꿈의 해석
created_at: 2023-07-01 22:42:30
updated_at: 2023-07-01 22:42:30
---
# 제1장 - 꿈의 문제에 관한 학문적 문헌

* 다음을 증명해보자.
    1. 꿈을 해석할 수 있는 심리학적 기법이 있음
    2. 모든 꿈은 의미 깊은 마음의 소산임
* 꿈은 마음의 힘이 서로 협력하거나 반발하면서 생긴다.

* 꿈에 대한 이해는 이렇다 할 성과를 거두지 못하고 있다.
    * 그리스·로마 시대에는 꿈을 신이나 귀신들의 계시라고 믿었다. 또한 꿈을 꾸는 사람에 대한 어떤 예연이나 전조를 나타낸다고 믿었다.
    * 고대 철학자들은 점복술로 꿈을 풀이, 즉 꿈을 가치나 신빙성에 따라 구분하거나 분류했다.
* 꿈에 대한 아리스토텔레스의 해석
    * 꿈은 초자연적인 계시에서 유래하는 것이 아닌, 인간 정신의 법칙에 의해 자는 중에 영혼이 활동하는 것
    * 꿈은 수면 중에 일어나는 자극을 확대 해석함

        ⇒ 낮에는 알 수 없는 체내 변화의 첫 징조를 알 수 있음 [^1]
* 고대인은 꿈의 대조적인 두 흐름을 파악하고 있었다.
    * 참되고 가치 있는 꿈 : 경고나 예언 목적
    * 무가치하고 혼미한 꿈 : 미혹·타락의 목적
* 그루페(P. O. Gruppe)는 마크로비우스와 알테미도로스의 꿈의 분류를 다음과 같이 소개한다.
    1. 현재 (또는 과거)에 의해서만 영향을 받아 미래와 관련 없는 유형
    
        `굶주림 또는 굶주림을 없애거나 만드는 따위의 주어진 표상'을 직접 재현하는 반수면 상태와 몽마(夢魔) 에피알테스[^2]처럼 지나치게 확대 해석하는 환상을 포함

    2. 미래를 예고하는 꿈
        * 꿈 속에서 받는 직접적인 예언
        * 눈앞에 닥친 일의 예언
        * 해석을 필요로 하는 상징적인 꿈

# 참고 문헌

1. 지그문트 프로이트, 『꿈의 해석』 4판, 김기태 역, 선영사, 2021.

[^1]: 이 내용을 보고 태몽을 통해 태아가 잉태할 징조를 확인하는 풍습이 떠올랐다. 찾아보니 이상하게 인도와 한국 이외에는 잘 나타나지는 않는 문화인 것 같다.

[^2]: 악몽을 지칭하기 위해 고대 그리스 철학자 갈레노스가 만든 개념. 역사적으로 악몽은 초자연적인 힘을 가진 신화 속 생명체(그리스에서는 에피알테스, 로마에서는 인큐버스)에 의해 발생한다고 믿어져 왔다. [위키백과](https://en.wikipedia.org/wiki/Ephialtes_(illness)) 참조.