---
title: 유한 오토마톤
created_at: 2023-07-02 18:05:32
updated_at: 2023-07-02 18:05:32
---
컴퓨터란 무엇인가? 어리석은 질문일 수 있지만, [계산 이론](/ko/computation_theory)에서의 모든 개념은 엄밀해야 하므로, 컴퓨터를 엄밀하게 정의할 필요가 있다. 그래서 등장한 개념이 컴퓨터의 엄밀한 형태인 ***계산 모델***이다. 여러 계산 모델 중 가장 간단한 모델이 ***유한 오토마타*** 또는 ***유한 상태 머신***이다.

# 엄밀한 정의

유한 오토마톤은 5-튜플 $(Q, \Sigma, \delta, q_0, F)$이다. 이때,
1. $Q$는 상태로 구성된 유한 집합인 ***상태 집합***이고,
2. $\Sigma$는 ***알파벳***이라고 불리는 유한 집합,
3. $\delta : Q \times \Sigma \to Q$는 ***전이 함수***,
4. $q_0 \in Q$는 ***시작 상태***,
5. $F \subseteq Q$는 ***인식 상태***의 집합이다.

# 참고 문헌

1. M. Sipser, *Introduction to the Theory of Computation*, 3rd ed. Cengage Learning, 2012.